package edu.training.jc.simple_output;

public class TableOutput_07 {
    public static void main(String[] args) {
        System.out.println("-------------------------------------\n|\t\tid\t\t|\t\trole\t\t|\n-------------------------------------\n|\t\t1\t\t|\t\tguest\t\t|\n|\t\t10\t\t|\t\tuser\t\t|\n|\t\t100\t\t|\t\tadmin\t\t|\n-------------------------------------\n\nДля совпадения с оригиналом необходимо было удвоить к-во табуляции. \nВ одиночном виде всё получается ровно, но короче, чем показано в задании, \nхотя дословно условие подразумевает наличие только одного символа табуляции.");
    }
}
